###HowToUse_derive

# 使用電腦去計算導數，以梯度下降法來計算一階導數

#######################################################

# deriv(方程式, 自變數, 是否做為function表示)
# deriv(expr, name, function.arg)
# 生成導數Derivative
dx <- deriv(y~x^3,"x")
#dx

# 設定x
x <- 1:2

# 運行計算，求導數
eval(dx)

#######################################################

# 以函數的方式去調用計算公式

dx <- deriv(y~sin(x),"x",func=T)
# dx
# mode(dx) 檢視dx的類型
dx(c(pi,4*pi))

#######################################################

# 摘自張丹─粉絲日誌
# http://blog.fens.me/r-math-derivative/

# 函數          原函數            導函數
# 常數函數      y=C               y'=0
# 冪函數        y=x^n             y'=n*x^(n-1)
# 指數函數      y=a^x             y'=a^x*ln(a)
#               y=exp(1)^x        y'=exp(1)^x
# 對數函數      y=log(x,base=a)   y'=1/(x*ln(a)) (a>0，且a!=1,x>0)
#               y=ln(x)           y'=1/x
# 正弦函數      y=sin(x)          y'=cos(x)
# 餘弦函數      y=cos(x)          y'=-sin(x)
# 正切函數      y=tan(x)          y'=sec(x)^2=1/cos(x)^2
# 餘切函數      y=cot(x)          y'=-csc(x)^2=1/sin(x)^2
# 正割函數      y=sec(x)          y'=sec(x)*tan(x)
# 餘割函數      y=csc(x)          y'=-csc(x)*cot(x)
# 反正弦函數    y=arcsin(x)       y'=1/sqrt(1-x^2)
# 反餘弦函數    y=arccos(x)       y'=-1/sqrt(1-x^2)
# 反正切函數    y=arctan(x)       y'=1/(1+x^2)
# 反餘切函數    y=arccot(x)       y'=-1/(1+x^2)
# 反正割函數    y=arcsec(x)       y'=1/abs(x)*(x^2-1)
# 反餘割函數    y=arccsc(x)       y'=-1/abs(x)*(x^2-1)

########################################################

# 常數函數

dx <- deriv(y~3+10*x,"x",func=T)
dx(1)

########################################################

# 冪函數

dx <- deriv(y~x^4,"x",func=T)
dx(2)

########################################################

# 指數函數

dx <- deriv(y~4^x,"x",func=T)
dx(2)

dx <- deriv(y~exp(1)^x,"x",func=T)
dx(2)

########################################################

# 對數函數

# 計算y=ln(x)函數的導數
dx <- deriv(y~log(x),"x",func=T)
dx(2)

# 若要計算y=log2(x)的導數(以2為底的log函數)，
# R僅支援以自然對數為底的對數再進行導數計算，
# 根據對數的換底公式換成以自然常數為底的對數　
# y=log2(x)=log(x)/log(2)


########################################################

# 正弦函數

dx <- deriv(y~sin(x),"x",func=T)
dx(pi)

########################################################

# 餘弦函數

dx <- deriv(y~cos(x),"x",func=T)
dx(pi/2)

########################################################

# 正切函數

dx <- deriv(y~tan(x),"x",func=T)
dx(pi/6)

########################################################

# 餘切函數

dx <- deriv(y~1/tan(x),"x",func=T)
dx(pi/6)

########################################################

# 反正弦函數

dx <- deriv(y~asin(x),"x",func=T)
dx(pi/6)

########################################################

# 反餘弦函數

dx <- deriv(y~acos(x),"x",func=T)
dx(pi/6)

########################################################

# 反正切函數

dx <- deriv(y~atan(x),"x",func=T)
dx(pi/6)

########################################################

# 二階導數計算
# deriv3(expr, name, func)
# 第一個結果為一階導數
# 第二個結果為二階導數
dx <- deriv3(y~sin(a*x),"x",func=T)
dx(pi/3)

dx <- deriv3(y~a*x^4+b*x^3+x^2+x+c,"x",func=function(x,a=2,b=1,c=3){})
dx(2)

########################################################

# 偏導數計算 example 1

fxy <- expression(2*x^2+y+3*x*y^2) #二元導數公式

dxy <- deriv(fxy,c("x","y"),func=T)
#dxy
dxy(1,1)

########################################################

# 偏導數計算 example 2 

fxy <- expression(x^y+exp(x*y)+x^2-2*x*y+y^3+sin(x*y))
dxy <- deriv(fxy,c("x","y"),func=T)
dxy(1,3)
dxy(0,0) # x的偏導數無意義， y的偏導數負無窮大

# d2f(x,y)/dx2 , d2f(x,y)/dxdy d2f(x,y)/dy2
d2xy <- deriv3(fxy,c("x","y"),func=T)
d2xy(1,3)

########################################################
  